# EnergyAnalysisMasszoneUseenergydatasettings Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisMasszoneUseenergydatasettings Property
ParameterTypeId Class See Also
---
"Use Energy Data"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisMasszoneUseenergydatasettings { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisMasszoneUseenergydatasettings As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisMasszoneUseenergydatasettings {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace